# 切片

# 切片可以用来 获取list或tuple指定索引范围内的数据,比如:
L = ['Mike', 'Tom', 'Cherry', 'Candy', 'Xia']
r = L[0:3]
print(r)   # 输出 ['Mike', 'Tom', 'Cherry']，L[0:3]，代表从0开始取，直到索引为3，但不包括索引3

r1 = L[:3]
print(r1)  # 输出 ['Mike', 'Tom', 'Cherry']

r2 = L[-1]
print(r2)  # 输出 Xia

r3 = L[-2:]
print(r3)  # 输出 ['Candy', 'Xia']

r4 = L[-2:-1]
print(r4)  # 输出 ['Candy']


# 创建一个 100 长度的 list
r5 = list(range(100))

# 取出 11 - 20
print(r5[11:21])  # 输出 [11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

# 取出所有5的倍数
print(r5[5::5])   # 输出 [5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

# 如果什么都不写，只写[:]就可以原样复制一个list：
print(r5[:])

# tuple也是一种list，唯一区别是tuple不可变。因此，tuple也可以用切片操作，只是操作的结果仍是tuple：

# 字符串'xxx'也可以看成是一种list，每个元素就是一个字符。因此，字符串也可以用切片操作，只是操作结果仍是字符串：

















